read_verilog -sv -defer sbp_lookup_stage.sv
chparam -set STAGE_ID 1
hierarchy -check
prep -top sbp_lookup_stage -flatten
json -o sbp_lookup_stage.json

#proc; opt; fsm; opt; memory; opt

synth_xilinx

